Портал_EDT/src/Catalogs/Аук_ВидыАукционов/Аук_ВидыАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аук_ВидыАукционов</name>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.Аук_ВидыОперацийАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Аук_ПродуктыАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>СРаспределениемСуммы</name>
    <comment>Признак того, что при подведении итогов по аукциону данного вида будет использоваться распределение суммы аукциона</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоЗначенийСтруктурыСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоЗначенийСтруктурыВводныхДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогВариантВыбора</name>
    <comment>0 - Минимум, 1 - Максимум</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогФормула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточныйИтогШаблонРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогФормула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогРаспределяемаяСуммаОсновная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательныйИтогРаспределяемаяСуммаДополнительная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураСтавки</name>
    <attributes>
      <name>ЭлементСтавки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОбязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураНачальныхДанных</name>
    <attributes>
      <name>ЭлементДанных</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПоУмолчанию</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЧасы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Портал_EDT/src/Catalogs/Аук_ВидыАукционов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачальнаяИнициализация();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьИнтерфейсПоУсловиям();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЭтотОбъект.ЭтоНовыйВидАукциона = Параметры.Ключ.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Аук_ОбщийКлиент.ЗапускМастераПоРаспределениюУчастниковПоВидам(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПромежуточныйИтогФормулаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операнды",			Аук_ОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число")));
	ПараметрыФормы.Вставить("ИсходнаяФормула",	Объект.ПромежуточныйИтогФормула);
	
	Оповещение = Новый ОписаниеОповещения("ВводФормулыПромежуточногоИтога_Продолжить", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Аук_ВидыАукционов.Форма.КонструкторФормулы", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводФормулыПромежуточногоИтога_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ПромежуточныйИтогФормула = Результат;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогФормулаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная)
		 Или ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная)
	Тогда	 
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Операнды",								ОперандыДляРасчетаОкончательногоИтога());																			
		ПараметрыФормы.Вставить("ИсходнаяФормула",						Объект.ОкончательныйИтогФормула);
		ПараметрыФормы.Вставить("ЭтоФормулаРасчетаОкончательныхИтогов",	Истина);
		
		Оповещение = Новый ОписаниеОповещения("ВводФормулыОкончательногоИтога_Продолжить", ЭтотОбъект);
		
		ОткрытьФорму("Справочник.Аук_ВидыАукционов.Форма.КонструкторФормулы", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Формулу мржно задать только если укзаны основное или дополнительное поля'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводФормулыОкончательногоИтога_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ОкончательныйИтогФормула = Результат;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаРасчетИтогов Тогда
		
		ОбновитьСписокВыбораРаспределяемойСуммыОсновной();
		
		ОбновитьСписокВыбораРаспределяемойСуммыДополнительной();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогРаспределяемаяСуммаОсновнаяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная = "[" + ВыбранноеЗначение + "]";
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончательныйИтогРаспределяемаяСуммаДополнительнаяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная = "[" + ВыбранноеЗначение + "]";
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьСписокЭтаповПоУмолчанию(Команда)
	
	Объект.ЭтапыПоУмолчанию.Очистить();	
	
	масЭтапы = Аук_ОбщийКлиентСервер.СписокЭтаповПоУмолчанию();
	
	Для Каждого ЭлЭтап Из масЭтапы Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЭтапыПоУмолчанию.Добавить(), ЭлЭтап);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьДанныеПередЗаписью(пБулЭтоЗакрытие)
	Объект.ПромежуточныйИтогФормула = СокрЛП(Объект.ПромежуточныйИтогФормула);
		
	Если ПроверитьДанныеФормыПередЗаписью(пБулЭтоЗакрытие) Тогда	
		ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьИнтерфейсПоУсловиям()
	
	Если ЭтотОбъект.БлокироватьИзмененияДанных Тогда
		Аук_ОбщийКлиент.УставновитьРежимТолькоПросмотрУВсехЭлементов(ЭтотОбъект,, "Наименование,Описание");
		
		Аук_ОбщийКлиент.УстановитьВидимостьКоманд(ЭтотОбъект,, "ЗаписатьИЗакрытьКастомная,ЗаписатьКастомная");
	Иначе
		Элементы.НадписьЗапретРедактирования.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ОперандыДляРасчетаОкончательногоИтога()

	масРезультат = Аук_ОбщийКлиентСервер.ПредопределенныеОперандыДляРасчетаОкончательногоИтога();
	
	масОперандыСтавка = Аук_ОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число"));	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масРезультат, масОперандыСтавка);
	
	//масНачДанные = Аук_ОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураНачальныхДанных", "ЭлементДанных", Тип("Число"));
	//
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масРезультат, масНачДанные);
	
	Возврат масРезультат;
	
КонецФункции	

&НаКлиенте
Функция ПроверитьДанныеФормыПередЗаписью(пБулЭтоЗакрытие)

	Если Объект.СРаспределениемСуммы Тогда
		
		Если Не ДанныеДляРасчетаОкончательногоИтогаЗаполнены() Тогда	
			Возврат Ложь;
			
			стрОповещение = НСтр("ru = 'Заполните необходимые данные для расчета окончательного итога или снимите флаг ""С распределением суммы""'");
			
			ПоказатьПредупреждение(, стрОповещение,, НСтр("ru = 'Предупреждение'")); 	
		КонецЕсли;
	Иначе	
		Если ДанныеДляРасчетаОкончательногоИтогаЗаполнены() Тогда
			Возврат Ложь;
			
			стрВопрос = НСтр("ru = 'Заполнены необходимые данные для расчета итогов. Может установим флаг ""С распределением суммы""?'");
			
			Оповещение = Новый ОписаниеОповещения("УстановкаФлагаВопрос_Продолжить", ЭтотОбъект, пБулЭтоЗакрытие);
			
			ПоказатьВопрос(Оповещение, стрВопрос, РежимДиалогаВопрос.ДаНет); 
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура УстановкаФлагаВопрос_Продолжить(Результат, пБулЭтоЗакрытие) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СРаспределениемСуммы = Истина;
		
		ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНачать(пБулЭтоЗакрытие)
	Записать();
	
	Если пБулЭтоЗакрытие Тогда
		Закрыть();
	Иначе
		Аук_ОбщийКлиент.ЗапускМастераПоРаспределениюУчастниковПоВидам(ЭтотОбъект);	
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Функция ДанныеДляРасчетаОкончательногоИтогаЗаполнены()

	Возврат ЗначениеЗаполнено(Объект.ОкончательныйИтогФормула)
			И (ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаОсновная)
				Или ЗначениеЗаполнено(Объект.ОкончательныйИтогРаспределяемаяСуммаДополнительная))
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьСписокВыбораРаспределяемойСуммыДополнительной()
	
	масСписокЭлементовСтрокой = Аук_ОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураНачальныхДанных", "ЭлементДанных", Тип("Число"));
	
	Элементы.ОкончательныйИтогРаспределяемаяСуммаДополнительная.СписокВыбора.ЗагрузитьЗначения(масСписокЭлементовСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораРаспределяемойСуммыОсновной()
	
	масСписокЭлементовСтрокой = Аук_ОбщийКлиент.СписокПредставленийПоЭлементамТабличнойЧасти(Объект, "СтруктураСтавки", "ЭлементСтавки", Тип("Число"));
	
	Элементы.ОкончательныйИтогРаспределяемаяСуммаОсновная.СписокВыбора.ЗагрузитьЗначения(масСписокЭлементовСтрокой);
	
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	
	// Заполнить список этапов по-умолчанию
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.ЭтапыПоУмолчанию.Очистить();
			
			масЭтапы = Аук_ОбщийКлиентСервер.СписокЭтаповПоУмолчанию();
			
			Для Каждого ЭлЭтап Из масЭтапы Цикл
				ЗаполнитьЗначенияСвойств(Объект.ЭтапыПоУмолчанию.Добавить(), ЭлЭтап);	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Инициализировать флаг "БлокироватьИзмененияДанных"
	Если Не Параметры.Ключ.Пустая() Тогда
		ЭтотОбъект.БлокироватьИзмененияДанных = Справочники.Аук_Аукционы.ЕстьАукционыСВидом(Объект.Ссылка);	
	КонецЕсли;	
		
КонецПроцедуры	

#КонецОбласти
